{
  "backend/main.mo": "Motoko canister defining access control, blob storage mixins, data types, and CRUD logic for payments, receipts, committee members, jatres, contacts, gallery, and temple account.",
  "feature_evidence.json": "Feature evidence report mapping feature IDs to related files, components, and test IDs for the temple website project.",
  "frontend-file-summaries.txt": "Prewritten summaries describing the purpose of various frontend admin and global style files.",
  "frontend/index.css": "Tailwind base styles with OKLCH variables defining theme tokens for light and dark modes.",
  "frontend/index.html": "Root HTML file that loads the React application via main.tsx.",
  "frontend/src/App.tsx": "Configures TanStack Router routes for all public and admin pages with layouts and protected admin access.",
  "frontend/src/components/auth/AdminRoute.tsx": "Route guard that checks admin authentication and displays loading, denial, or authorized content.",
  "frontend/src/components/auth/LoginButton.tsx": "Login/logout button handling Internet Identity authentication and query cache clearing.",
  "frontend/src/components/layout/AdminLayout.tsx": "Admin dashboard layout with navigation, responsive menu, and logout handling using Internet Identity.",
  "frontend/src/components/layout/PublicLayout.tsx": "Layout component with header, mobile navigation, footer, and temple-themed styling.",
  "frontend/src/config/temple.ts": "Defines static temple configuration details including names, location, UPI ID, and coordinates.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor tied to the user's identity and refreshes dependent queries when it changes.",
  "frontend/src/hooks/useAdminStatus.ts": "Checks whether the authenticated user is an admin using the actor's isCallerAdmin call.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity auth context, handles login, logout, and identity persistence.",
  "frontend/src/hooks/useQueries.ts": "Collection of React Query hooks for payment workflows, balances, receipts, donors, committee data, events, contacts, and gallery items.",
  "frontend/src/index.css": "Tailwind setup with custom color variables and utility classes for the temple theme.",
  "frontend/src/main.tsx": "Application entry that sets up React Query and Internet Identity providers before rendering App.",
  "frontend/src/pages/admin/AdminHomePage.tsx": "Admin dashboard page listing navigation cards for temple management sections.",
  "frontend/src/pages/admin/AdminLoginPage.tsx": "Admin login page that checks Internet Identity and admin status before rendering a login prompt or redirecting to the admin dashboard.",
  "frontend/src/pages/admin/BalanceDashboardPage.tsx": "Displays temple account balance and last-updated info with refresh support and explanatory notes.",
  "frontend/src/pages/admin/CommitteeManagementPage.tsx": "Allows admins to view, add, edit, and remove committee members using dialogs and mutation hooks.",
  "frontend/src/pages/admin/ContactsManagementPage.tsx": "Lets admins manage temple contact numbers, including adding, editing, and removing entries.",
  "frontend/src/pages/admin/DonorListPage.tsx": "Shows a table of all approved donors with amounts, dates, payment modes, and transaction IDs.",
  "frontend/src/pages/admin/GalleryManagementPage.tsx": "Provides UI to upload, list, and delete gallery media items with file handling and upload progress.",
  "frontend/src/pages/admin/JatreManagementPage.tsx": "Admin page to list, add, edit, and delete Jatres with a form dialog and backend mutations.",
  "frontend/src/pages/admin/PaymentApprovalsPage.tsx": "Admin interface to review, edit, approve, or reject pending payment confirmations.",
  "frontend/src/pages/admin/ReceiptViewPage.tsx": "Admin page to view a single receipt, download, print, share, cancel, or regenerate it.",
  "frontend/src/pages/public/CommitteePage.tsx": "Public page showing committee members with roles and basic privacy notice.",
  "frontend/src/pages/public/ContactsPage.tsx": "Public page listing temple contact numbers with loading states and fallback message.",
  "frontend/src/pages/public/DonationsPage.tsx": "Public donation page enabling UPI donations and showing instructions for payment confirmation.",
  "frontend/src/pages/public/GalleryPage.tsx": "Displays a grid of photo/video items fetched from the gallery API and shows a modal preview when an item is selected.",
  "frontend/src/pages/public/HomePage.tsx": "Renders the temple homepage with navigation cards linking to major public sections and showing basic temple info.",
  "frontend/src/pages/public/JatreFestivalsPage.tsx": "Fetches and lists festivals sorted by date, showing details and activities for each event.",
  "frontend/src/pages/public/LocationPage.tsx": "Shows the temple’s address with a Google Maps embed and provides a button to open navigation directions.",
  "frontend/src/pages/public/PaymentConfirmationPage.tsx": "Provides a form for submitting payment confirmation details and shows a success screen after submission.",
  "frontend/src/pages/public/TotalCollectionPage.tsx": "Displays total donation amount and count along with a privacy notice and link to the donations page.",
  "frontend/src/utils/formatters.ts": "Utility functions for formatting currency, dates, payment modes, committee roles, and generating timestamps.",
  "frontend/src/utils/receiptExport.ts": "Generates a printable HTML receipt in a new window, formatting receipt details and handling cancelled state overlay.",
  "frontend/src/utils/share.ts": "Provides helpers to share receipt info using the Web Share API with WhatsApp fallback.",
  "frontend/src/utils/urlParams.ts": "Utility functions for reading, persisting, and clearing URL parameters with sessionStorage support.",
  "frontend/tailwind.config.js": "Tailwind configuration defining theme extensions, custom colors, animations, and plugin setup.",
  "project_state.json": "Describes overall project goals, architecture notes, required images, and implemented features for the temple management site."
}